#1. Поработайте с переменными,# создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк
# и сохраните в переменные, выведите на экран.


value = 43 - 40
sum = 4 + 8
name = 'Alexander'

print(value)
print(sum)
print('Hi, my name is', name)

username = input('Введите ваше имя')
age = int(input('Введите ваш возраст'))
city = input('Введите город вашего проживания')
zipcode = int(input('Введит индекс места вашего проживания'))

print('Добрый день', username)
print('вам', age, 'лет')
print('вы проживаете в городе', city)
print('индекс вашего места проживания следующий', zipcode)
